IRP/src/InformationRegisters/DocumentFiscalStatus/DocumentFiscalStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DocumentFiscalStatus</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.DocumentFiscalStatuses</types>
    </type>
  </resources>
  <resources>
    <name>Device</name>
    <type>
      <types>CatalogRef.Hardware</types>
    </type>
  </resources>
  <resources>
    <name>DeviceNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ShiftNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CheckNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CheckDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>FiscalResponse</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DataPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.CashPayment</types>
      <types>DocumentRef.BankReceipt</types>
      <types>DocumentRef.BankPayment</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.MoneyTransfer</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.RetailReceiptCorrection</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/DocumentFiscalStatuses/DocumentFiscalStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>DocumentFiscalStatuses</name>
 <enumValues>
  <name>Prepaired</name>
 </enumValues>
 <enumValues>
  <name>Printed</name>
 </enumValues>
 <enumValues>
  <name>FiscalReturnedError</name>
 </enumValues>
 <enumValues>
  <name>NotPrinted</name>
 </enumValues>
</mdclass:Enum>

IRP/src/InformationRegisters/DocumentFiscalStatus/ManagerModule.bsl
#Region Public

// Set status.
//
// Parameters:
//  Document - DocumentRefDocumentName -
//  Status - EnumRef.DocumentFiscalStatuses
//  FiscalResponse - See EquipmentFiscalPrinterAPIClient.ProcessCheckSettings
//  DataPresentation - String - Data presentation
Procedure SetStatus(Document, Status, FiscalResponse, DataPresentation = "") Export
	
	// TODO: The parameter list needs to be refactored.
	// Temporarily read fiscal printer from CRS
	FiscalPrinter = 
		CommonFunctionsServer.GetAttributesFromRef(Document, "ConsolidatedRetailSales.FiscalPrinter")
			["ConsolidatedRetailSales"]["FiscalPrinter"];
	
	NewRecord = CreateRecordManager();
	NewRecord.Document = Document;
	NewRecord.Device = FiscalPrinter;
	NewRecord.Status = Status;
	NewRecord.DataPresentation = DataPresentation;
	
	HardwareServer.FixTypesForWrite(FiscalResponse);
	
	NewRecord.FiscalResponse = CommonFunctionsServer.SerializeJSON(FiscalResponse);
	If TypeOf(FiscalResponse) = Type("Structure") Then
		If FiscalResponse.Property("Out") 
				And FiscalResponse.Out.Property("DocumentOutputParameters") 
				And TypeOf(FiscalResponse.Out.DocumentOutputParameters) = Type("Structure") Then
			NewRecord.DeviceNumber = Format(FiscalResponse.Out.DocumentOutputParameters.DeviceNumber, "NG=");
			NewRecord.ShiftNumber = Format(FiscalResponse.Out.DocumentOutputParameters.ShiftNumber, "NG=");
			NewRecord.CheckNumber = Format(FiscalResponse.Out.DocumentOutputParameters.CheckNumber, "NG=");
			NewRecord.CheckDate = FiscalResponse.Out.DocumentOutputParameters.DateTime;
		EndIf;
	EndIf;
	NewRecord.Write(True);
EndProcedure

// Get status data.
// 
// Parameters:
//  Document - DocumentRefDocumentName - Document
// 
// Returns:
//  Structure - Get status data:
// * Status - EnumRef.DocumentFiscalStatuses - 
// * Device - CatalogRef.Hardware - 
// * DeviceNumberNumber - String - 
// * ShiftNumber - String - 
// * CheckNumber - String - 
// * CheckDate - Date - 
// * FiscalResponse - String - 
// * DataPresentation - String - 
// * IsPrinted - Boolean - 
Function GetStatusData(Document) Export
	StatusData = New Structure();
	StatusData.Insert("Status", Enums.DocumentFiscalStatuses.EmptyRef());
	StatusData.Insert("Device", Catalogs.Hardware.EmptyRef());
	StatusData.Insert("DeviceNumberNumber", "");
	StatusData.Insert("ShiftNumber", "");
	StatusData.Insert("CheckNumber", "");
	StatusData.Insert("CheckDate", Date(1,1,1));
	StatusData.Insert("FiscalResponse", "");
	StatusData.Insert("DataPresentation", "");
	StatusData.Insert("IsPrinted", False);
	
	Query = New Query;
	Query.Text = "SELECT
	|	DocumentFiscalStatus.Status AS Status,
	|	DocumentFiscalStatus.Device AS Device,
	|	DocumentFiscalStatus.DeviceNumber AS DeviceNumber,
	|	DocumentFiscalStatus.ShiftNumber AS ShiftNumber,
	|	DocumentFiscalStatus.CheckNumber AS CheckNumber,
	|	DocumentFiscalStatus.CheckDate AS CheckDate,
	|	DocumentFiscalStatus.FiscalResponse AS FiscalResponse,
	|	DocumentFiscalStatus.DataPresentation AS DataPresentation
	|FROM
	|	InformationRegister.DocumentFiscalStatus AS DocumentFiscalStatus
	|WHERE
	|	DocumentFiscalStatus.Document = &Document";
	Query.SetParameter("Document", Document);
	QuerySelection = Query.Execute().Select();
	If QuerySelection.Next() Then
		FillPropertyValues(StatusData, QuerySelection);
		If StatusData.Status = Enums.DocumentFiscalStatuses.Printed Then
			StatusData.IsPrinted = True;
		EndIf;
	EndIf;
	
	Return StatusData;
EndFunction

#EndRegion

#Region AccessObject

// Get access key.
// See Role.TemplateInformationRegisters
//
// Returns:
//  Structure - Get access key:
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	Return AccessKeyStructure;
EndFunction

#EndRegion
